# 데이터 전처리 과제

* **데이터 설명**
  * 본 데이터는 A대학 도서관에서 제공하는 온라인 DB에 대한 사용자별 이용기록(Transaction)입니다.
  * user_id : 사용자ID
  * region : 지역코드
  * college : 단과대학코드
  * major : 전공코드
  * social_position : 직급코드
  * month : 이용월
  * weekday : 이용요일(1:일요일, 2:월요일, 3:화요일, 4:수요일, 5:목요일, 6:금요일, 7:토요일)
  * hour : 이용시각(24H)
  * DB : 이용 온라인 DB

### 0.0. 필요한 패키지를 로딩하세요

In [32]:
# 넘파이
# 판다스
import numpy as np
import pandas as pd

## 1. 데이터 로딩 및 문제 파악하기

### 1.1. 데이터를 로딩하고 처음 5개의 레코드를 출력하세요.

In [33]:
data_01 = pd.read_csv('DATA_01/DATA_01.csv')
data_01.head()

  user_id region college major social_position  month  weekday  hour     DB
0   U0002    R01   C0002   M09            S005    3.0        3    21  DB048
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044

### 1.2. 변수별 데이터 타입을 알아볼 수는 코드를 제시하고 문제점이 있을 경우 서술하세요.

In [4]:
data_01.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117729 entries, 0 to 117728
Data columns (total 9 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   user_id          117729 non-null  object
 1   region           117729 non-null  object
 2   college          117729 non-null  object
 3   major            115893 non-null  object
 4   social_position  117729 non-null  object
 5   month            116186 non-null  float64
 6   weekday          117729 non-null  int64
 7   hour             117729 non-null  int64
 8   DB               117729 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 8.1+ MB

In [5]:
data_01.dtypes

user_id             object
region              object
college             object
major               object
social_position     object
month              float64
weekday              int64
hour                 int64
DB                  object
dtype: object

### 1.3. 수치형 변수의 요약 통계량을 제시하세요.

In [7]:
# describe() 활용
data_01.describe(include = [np.number]).T
#data_01.describe().T

            count       mean       std  min   25%   50%   75%   max
month    116186.0   6.879504  3.450912  1.0   4.0   7.0  10.0  12.0
weekday  117729.0   3.850946  1.871778  1.0   2.0   4.0   5.0   7.0
hour     117729.0  13.759974  6.733376  0.0  10.0  15.0  19.0  30.0

### 1.4. 범주형 변수의 요약 통계량을 제시하세요.

In [8]:
data_01.describe(include = [np.object]).T

                  count unique    top    freq
user_id          117729   5473  U0061    2477
region           117729      3    R01  110166
college          117729     72  C0001   52531
major            115893     11    M04   27590
social_position  117729      8   S005   39578
DB               117729     76  DB031   23100

## 2. 데이터의 문제 수정하기

### 2.1. NULL값이 존재하는 변수 중 범주형 변수의 NULL값을 'UNKNOWN'으로 대체하고 처리 결과를 제시하세요.

In [9]:
data_01.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117729 entries, 0 to 117728
Data columns (total 9 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   user_id          117729 non-null  object
 1   region           117729 non-null  object
 2   college          117729 non-null  object
 3   major            115893 non-null  object
 4   social_position  117729 non-null  object
 5   month            116186 non-null  float64
 6   weekday          117729 non-null  int64
 7   hour             117729 non-null  int64
 8   DB               117729 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 8.1+ MB

In [10]:
data_01.isnull().sum()

user_id               0
region                0
college               0
major              1836
social_position       0
month              1543
weekday               0
hour                  0
DB                    0
dtype: int64

In [38]:
data_01['major'] = data_01['major'].fillna('Unknown')
data_01.isnull().sum()

user_id               0
region                0
college               0
major                 0
social_position       0
month              1543
weekday               0
hour                  0
DB                    0
dtype: int64

### 2.2. NULL값이 존재하는 변수 중 수치형 변수의 NULL값은 제거하고 처리 뒤 데이터의 행과 열을 제시하세요.

In [39]:
data_01 = data_01.dropna(subset=['month'])
data_01.isnull().sum()

user_id            0
region             0
college            0
major              0
social_position    0
month              0
weekday            0
hour               0
DB                 0
dtype: int64

## 3. 데이터 파악하기

### 3.1. 전공 중 가장 많은 전공 코드를 제시하세요.

In [35]:
data_01 = pd.read_csv('DATA_01/DATA_01.csv')
data_01.head()

  user_id region college major social_position  month  weekday  hour     DB
0   U0002    R01   C0002   M09            S005    3.0        3    21  DB048
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044

In [40]:
data_01['major'].value_counts()

M04        27241
M11        15435
M08        12536
M09        12331
M05        11500
M01        11086
M03         7433
M06         7343
M07         3564
M02         3021
M10         2888
Unknown     1808
Name: major, dtype: int64

In [46]:
data_01.major.value_counts()

M04        27241
M11        15435
M08        12536
M09        12331
M05        11500
M01        11086
M03         7433
M06         7343
M07         3564
M02         3021
M10         2888
Unknown     1808
Name: major, dtype: int64

In [47]:
data_01.major.value_counts().max()

27241

In [44]:
g = data_01.major.value_counts()
g.index[0]

'M04'

### 3.2. 지역이 R02이면서 전공이 M01 이고 오전9시부터 10시까지 사용한 사람은 몇 명인지 제시하세요.

In [57]:
d1 = data_01.region == 'R02'
d2 = data_01.major == 'M01'
d3 = (data_01.hour >= 9) & (data_01.hour <= 10)
d = d1 & d2 & d3
data_01[d].shape

(45, 9)

In [8]:
dt = data_01[['region','major','hour']]
dt.head()

  region major  hour
0    R01   M09    21
1    R01   M01    12
2    R01   M01    13
3    R01   M11    14
4    R01   M08    14

In [9]:
r_dt = ['R02']
c_dt = dt.region.isin(r_dt)
c_dt

0         False
1         False
2         False
3         False
4         False
          ...
117724    False
117725    False
117726    False
117727    False
117728    False
Name: region, Length: 117729, dtype: bool

In [10]:
c_dt.value_counts()

False    110317
True       7412
Name: region, dtype: int64

In [11]:
m_dt = dt.major == 'M01'
m_dt

0         False
1          True
2          True
3         False
4         False
          ...
117724    False
117725    False
117726    False
117727    False
117728    False
Name: major, Length: 117729, dtype: bool

In [12]:
dt.loc[c_dt&m_dt].head()

     region major  hour
336     R02   M01    17
4244    R02   M01    21
4267    R02   M01    23
4268    R02   M01    23
7014    R02   M01     9

In [13]:
h_dt = dt.hour.between(9, 10)

In [14]:
dt.loc[c_dt&m_dt&h_dt].head()

      region major  hour
7014     R02   M01     9
15109    R02   M01    10
15110    R02   M01    10
15111    R02   M01    10
15325    R02   M01    10

In [17]:
dt.loc[c_dt&m_dt&h_dt].shape

(45, 3)

In [6]:
id = ['R02']
qs = "region in @id and major == 'M01' and 9 <= hour <= 10"
data_01.query(qs).region.value_counts()

R02    45
Name: region, dtype: int64

In [49]:
data_01.query(qs).shape

(45, 9)

### 3.2 에서 구한 내용에서 컬럼명이 user_id, region, major, hour의 리스트를 보여주세요

In [51]:
# data_01.loc[d, ['user_id','region','major','hour']].head()
cols = ['user_id','region','major','hour']
data_01.loc[d, cols].head()

      user_id region major  hour
7014    U1120    R02   M01     9
15109   U1899    R02   M01    10
15110   U1899    R02   M01    10
15111   U1899    R02   M01    10
15325   U1899    R02   M01    10

In [18]:
list = data_01.query(qs)
col = ['user_id','region','major','hour']
list[col].head()

      user_id region major  hour
7014    U1120    R02   M01     9
15109   U1899    R02   M01    10
15110   U1899    R02   M01    10
15111   U1899    R02   M01    10
15325   U1899    R02   M01    10

### 3.2 에서 구한 내용에서 컬럼수를 처음부터 6개만 보여주세요.

In [55]:
data_01.iloc[d.values, range(6)].head()

      user_id region college major social_position  month
7014    U1120    R02   C0053   M01            S004    4.0
15109   U1899    R02   C0055   M01            S006    5.0
15110   U1899    R02   C0055   M01            S006    5.0
15111   U1899    R02   C0055   M01            S006    5.0
15325   U1899    R02   C0055   M01            S006    5.0

In [39]:
data_01.query(qs).iloc[:, 0:6].head()

      user_id region college major social_position  month
7014    U1120    R02   C0053   M01            S004    4.0
15109   U1899    R02   C0055   M01            S006    5.0
15110   U1899    R02   C0055   M01            S006    5.0
15111   U1899    R02   C0055   M01            S006    5.0
15325   U1899    R02   C0055   M01            S006    5.0

### 3.3. 월요일(weekday=2)에 가장 빠른 시간에 이용한 기록을 5개 제시하세요.

In [3]:
data_01 = pd.read_csv('DATA_01/DATA_01.csv')
data_01.head()

  user_id region college major social_position  month  weekday  hour     DB
0   U0002    R01   C0002   M09            S005    3.0        3    21  DB048
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044

In [58]:
dw = data_01.weekday == 2
data_01[dw].head()

  user_id region college major social_position  month  weekday  hour     DB
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044
5   U0007    R01   C0001   M08            S005    3.0        2    14  DB044

In [61]:
# 가장 빠른 시간
data_01[dw]['hour'].min()

0

In [62]:
dh = data_01.hour == 0
ds = dw & dh
data_01[ds].head()

    user_id region college major social_position  month  weekday  hour     DB
235   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
236   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
237   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
238   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
239   U0131    R02   C0031   M07            S004    3.0        2     0  DB031

In [60]:
data_01[dw].sort_values(['weekday','hour'], ascending=[True, True]).head()

    user_id region college major social_position  month  weekday  hour     DB
235   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
236   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
237   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
238   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
239   U0131    R02   C0031   M07            S004    3.0        2     0  DB031

In [19]:
wk = data_01.sort_values(['weekday','hour'], ascending=[True, True])
wk

,user_id,region,college,major,social_position,month,weekday,hour,DB
81,U0042,R01,C0001,M05,S006,3.0,1,0,DB058
933,U0350,R01,C0002,M07,S005,3.0,1,0,DB030
1632,U0576,R02,C0010,M08,S005,3.0,1,0,DB051
1633,U0577,R01,C0015,M03,S004,3.0,1,0,DB065
1634,U0576,R02,C0010,M08,S005,3.0,1,0,DB055
...,...,...,...,...,...,...,...,...,...
114271,U5460,R01,C0001,M05,S006,12.0,7,30,DB002
114763,U5364,R01,C0006,M11,S004,12.0,7,30,DB065
116482,U5951,R01,C0001,M03,S006,1.0,7,30,DB065
116797,U3839,R01,C0001,M01,S001,2.0,7,30,DB039
117347,U0675,R01,C0006,M11,S004,2.0,7,30,DB031

In [5]:
wk[wk.weekday == 2].head()

    user_id region college major social_position  month  weekday  hour     DB
235   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
236   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
237   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
238   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
239   U0131    R02   C0031   M07            S004    3.0        2     0  DB031